Repository: sperezmaz/Dr.ScratchJr
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: About
es: Sobre nosotros

source: Account deleted
es: Cuenta eliminada

source: Back to Home Pag
es: Volver a la Pagina Principal

source: Go Back
es: Volver

source: Analysis
es: Análisis

source: # Variability (Use of blocks)
es: # Variabilidad (Uso de bloques)

source: Level
es: Nivel

source: # Bad habits
es: # Malos hábitos

source: # Creativity
es: # Creatividad

source: # Other data
es: # Otros datos

source: Bad habits
es: Malos hábitos

source: Dead code
es: Código muerto

source: Sequences of blocks that will not be executed because they don’t start with an Triggering block. It is also considered dead code when a sequence starts with the Triggering block "Start with message" but there isn't any "Send message" block of the same color in the project.
es: Secuencias de bloques que no se van a ejecutar porque no comienzan por un bloque de Evento. También es considerado código muerto cuando una secuencia comienza por el bloque de Evento 'Comenzar con mensaje' pero no hay en el proyecto un bloque 'Enviar mensaje' del mismo color.

source: Sequences with adjacent blocks
es: Secuencias con bloques adyacentes

source: Sequences that have multiple contiguous blocks that are the same. This is a bad habit because we should use only one block and indicate the number of times the action of the block is repeated.
es: Secuencias que tienen bloques contiguos iguales. Es un mal habito porque se debe usar un solo bloque e indicar el número de veces que se repite la acción del bloque.

source: Unfinished code
es: Código inacabado

source: Sequences of blocks that don't end with a "End " block.
es: Secuencias de bloques que no terminan con un bloque de 'Finalización'.

source: Characters same name in page
es: Personajes con mismo nombre en una página

source: Characters with the same name on a page. Even if the character is displayed in ScratchJr, you must name the character correctly when you create it so that there are no characters with the same name on the same page.
es: Personajes con el mismo nombre en una página. Aunque el personaje se visualice en ScratchJr, se debe nombrar correctamente el personaje al crearlo para que no haya personajes con el mismo nombre en la misma página.

source: Language
es: Idioma

source: Translate
es: Traducir

source: User Profile
es: Perfil del Usuario

source: Change password
es: Cambiar contraseña

source: Log out
es: Cerrar sesión

source: Log in
es: Iniciar sesion

source: Home
es: Inicio

source: Students
es: Estudiantes

source: Profile
es: Perfil

source: Settings
es: Ajustes

source: Functioning
es: Funcionalidad

source: Contact us
es: Contactanos

source: Upload
es: Subir

source: Analyze
es: Analizar

source: Analyze zip
es: Analizar zip

source: Welcome to Dr.ScratchJr
es: Bienvenido a Dr.ScratchJr

source: On this website you can analyze your student's or your children's ScratchJr projects based on various aspects. You can do this by saving all the results of your students by registering in the application.
es: En esta pagina web podrá analizar los proyectos ScratchJr de sus alumnos o de sus hijos en función de varios aspectos. Podrá hacerlo guardando todos los resultados de sus alumnos registrandose en la aplicación

source: Or analyze a project without the need to register directly here
es: O analiza un proyecto sin tener que registrarse directamente aquí

source: On this website you can analyze your student's or your children's ScratchJr projects based on various aspects. The results of previous analysis are available in the <a href="/review/"><i>Students</i></a> section.
es: En esta pagina web podrá analizar los proyectos ScratchJr de sus alumnos o de sus hijos en función de varios aspectos. Los resultados de anteriores analisis aparecen en la sección <a href="/review/"><i>Estudiantes</i></a>

source: Analyze proyect
es: Analizar proyecto

source: <p>Select an existing student or write a new student:</p>
es: <p>Selecciona un estudiante existente o escribe un estudiante nuevo:</p>

source: Student:
es: Estudiante:

source: Upload proyect
es: Subir proyecto

source: Analyze multiple projects
es: Analizar varios proyectos

source: <p>Upload multiple zipped projects with files name <i>"ProjectName-StudentName.sjr"</i> in a single .zip file: </p>
es: <p>Sube varios proyectos comprimidos en un zip, con el nombre de los archivos <i>"NombreProyecto-NombreEstudiante.sjr"</i>: </p>

source: Upload multiple zipped projects in a single .zip file:
es: Sube varios proyectos comprimidos en un solo archivo .zip:

source: If you have any questions or suggestions, please feel free to write to us
es: Si tienes alguna pregunta o sugerencia, no dudes en escribirnos

source: name@example.com
es: nombre@ejemplo.com

source: Subject
es: Asunto

source: Message
es: Mensaje

source: Account activation failed
es: Falló la activación de la cuenta

source: Your account is now activated.
es: Su cuenta ahora está activada.

source: Activate account at
es: Activar cuenta en

source: Link is valid for %(expiration_days)s days.
es: El enlace es válido por %(expiration_days)s días.

source: Activate account at:
es: Activar cuenta en:

source: Account activation on
es: Activación de cuenta en

source: Registration is currently closed.
es: Actualmente el registro está cerrado.

source: You are now registered. Activation email sent.
es: Ya estás registrado. Se envió el correo electrónico de activación.

source: No registration required
es: Sin necesidad de registro

source: Analyze a project without the need to register.
es: Analiza un proyecto sin tener que registrarse.

source: If you want to analyze projects without storing the results, you must log out.
es: Si quieres analizar proyectos sin almacenar los resultados, debes cerrar sesión.

source: Logout
es: Cerrar sesión

source: Control of students
es: Control de los estudiantes

source: If you want to keep track of your students and the results of all their projects, just log in.
es: Si quires llevar un seguimiento de tus alumnos y de los resultados de todos sus proyectos, tan solo tienes que iniciar sesión.

source: Login
es: Iniciar sesion

source: If you have previously uploaded a project, you can view it again in the <a href="/review/"><i>Students</i></a> section. If not, upload a project now directly here
es: Si has subido un proyecto anteriormente, puedes volver a verlo en la sección <a href="/review/"><i>Estudiantes</i></a>. Si no, sube un proyecto ahora directamente aquí

source: <h2>Students: %(students)s</h2>
es: <h2>Estudiantes: %(students)s</h2>

source: First Name
es: Nombre

source: Surname
es: Apellido

source: Username
es: Nombre de usuario

source: Update Profile
es: Actualizar Perfil

source: Forgot password
es: ¿Contraseña olvidada

source: Reset it!
es: Restablecer

source: Not member
es: ¿No eres miembro

source: Register!
es: ¡Registrate!

source: Logged out
es: Desconectado

source: Password changed
es: Contraseña cambiada

source: Password change
es: Cambio de contraseña

source: Please enter your old password, for security’s sake, and then enter your new password twice so we can verify you typed it in correctly.
es: Por favor, por razones de seguridad, ingrese su contraseña anterior, y luego ingrese la nueva contraseña dos veces para que podamos verificar que la ha escrito correctamente.

source: Password reset successfully
es: Contraseña restablecida con éxito

source: Password reset
es: Contraseña restablecida

source: Password reset failed
es: Error al restablecer la contraseña

source: Email with password reset instructions has been sent.
es: Se ha enviado un correo electrónico con instrucciones para restablecer la contraseña.

source: Reset password at %(site_name)s
es: Restablecer contraseña en %(site_name)s

source: Reset password
es: Restablecer contraseña

source: Forgotten your password? Enter your email address below, and we’ll email instructions for setting a new one.
es: ¿Ha olvidado su contraseña? Introduzca su dirección de correo electrónico y le enviaremos por correo electrónico las instrucciones para establecer una nueva.

source: Password reset on %(site_name)s
es: Restablecimiento de contraseña en %(site_name)s

source: Go Back
es: Volver

source: Details
es: Detalles

source: <h2>The student hasn't used these %(types)s blocks:</h2>
es: <h2>El alumno no ha usado estos bloques de %(types)s:</h2>

source: Starts the script when the Green Flag is tapped.
es: La secuencia de comandos se inicia al pulsar la bandera verde.

source: Starts the script when you tap on the character.
es: La secuencia de comandos se inicia al pulsar sobre el personaje.

source: Starts the script when the character is touched by another character.
es: La secuencia de comandos se inicia cuando otro personaje toca al personaje.

source: Starts the script whenever a message of the specified color is sent.
es: La secuencia de comandos se inicia cuando se envía un mensaje del color indicado.

source: Sends a message of the specified color.
es: Envía un mensaje del color indicado.

source: Rotates the character a specified amount. Turn 12 for a full rotation.
es: Gira el personaje la cantidad específicada. Se especifica ire 12 para una rotación completa.

source: Moves the character a specified number of grid squares up/down.
es: Mueve el personaje el número de cuadrículas indicado hacia arriba/abajo.

source: Moves the character a specified number of grid squares sideways.
es: Mueve el personaje el número de cuadrículas indicado hacia los lados.

source: Moves the character up a specified number of grid squares and then down again.
es: Mueve el personaje el número de cuadrículas indicado hacia arriba y después hacia abajo.

source: Resets the character's location to its starting position. (To set a new starting position, drag the character to the location).
es: Vuelve a situar al personaje en la posición inicial. (Para establecer una nueva posición inicial, arrastra el personaje hasta el lugar deseado).

source: Shows a specified message in a speech bubble above the character.
es: Aparece el mensaje indicado en un globo por encima del personaje.

source: Increases/Decreases the character's size.
es: Aumenta/Reduce el tamaño del personaje.

source: Returns the character to its default size.
es: Devuelve el personaje a su tamaño original.

source: Hide/show the character.
es: Oculta/muestra gradualmente al personaje.

source: Plays a 'Pop' Sound
es: Reproducce el sonido 'Pop'.

source: Plays a sound recorded by the user.
es: Reproduce un sonido grabado por el usuario.

source: Pauses the script for a specified amount of time (in tenths of seconds).
es: Pausa la secuencia de comandos durante el tiempo indicado (en décimas de segundo).

source: Stops all the characters' scripts.
es: Detiene todas las secuencias de comandos del personaje.

source: Runs the blocks inside a specified number of times.
es: Ejecuta los bloques un número indicado de veces.

source: Changes the rate at which certain blocks are run.
es: Cambia la velocidad a la que se ejecutan determinados bloques.

source: Indicates the end of the script (but does not affect the script in any way).
es: Indica el final de la secuencia de comandos (pero no afecta en modo alguno a la secuencia).

source: Runs the script over and over.
es: Ejecuta la secuencia de comandos una y otra vez.

source: Changes to the specified page of the project.
es: Cambia a la página del proyecto indicada.

source: Page
es: Página

source: Character
es: Personaje

source: Seq. Name
es: Nombre Secuencia

source: Sequence
es: Secuencia

source: This has been edited in name or appearance from the default
es: Se ha editado el nombre o la apariencia de

source: Sounds of the character recorded by the student
es: Sonidos del personaje grabados por el alumno

source: Images or sounds expire after one year
es: Imagenes o sonidos expiran tras un año

source: Perfect! student has used all %(types)s blocks
es: ¡Perfecto! el estudiante ha usado todos los bloques de %(types)s

source: Name
es: Nombre

source: Nº projects
es: Nº proyectos

source: Delete
es: Eliminar

source: Export
es: Exportar

source: Student
es: Estudiante

source: Project
es: Proyecto

source: File name
es: Nombre del archivo

source: Finalize
es: Finalizar

source: Delete account
es: Eliminar cuenta

source: Projects
es: Proyectos

source: Date
es: Fecha

source: # Variability(Use of blocks)
es: # Variabilidad(Uso de bloques)

source: Upload multiple projects
es: Subir varios proyectos

source: You can change the names:
es: Puedes cambiar los nombres:

source: Quantity
es: Cantidad

source: Upload proyect:
es: Subir proyecto:

source: Variability
es: Variabilidad

source: <h2>The program analyzes the variety of blocks that the student uses of each type of blocks that ScratchJr provides.</h2>
es: <h2>El programa analiza la variedad de bloques que el alumno utiliza de cada tipo de bloques proporcionados por ScratchJr.</h2>

source: Message sent!
es: ¡Mensaje enviado!

source: Project name
es: Nombre del proyecto

source: Bad_habits
es: Malos_hábitos

source: Other_data
es: Otros_datos

source: Triggerings
es: Eventos

source: Motion
es: Movimiento

source: Looks
es: Apariencia

source: Sound
es: Sonido

source: Ends
es: Finalización

source: Type of bad habit
es: Tipo de mal hábito

source: Existence bad habit
es: Existen malos hábitos

source: Sequence name
es: Nombre de la secuencia

source: NONE
es: NO

source: YES
es: SI

source: Total pages
es: Total de páginas

source: Pages
es: Páginas

source: Total characters
es: Total de personajes

source: Characters
es: Persoanjes

source: Total texts
es: Total de textos

source: Texts in pages
es: Textos en páginas

source: Total pages with unedited background
es: Total de páginas con fondo sin editar

source: Pages with unedited background
es: Páginas con fondo sin editar

source: Total unedited characters
es: Total de personajes sin editar

source: Unedited characters
es: Personajes sin editar

source: Characters in pages
es: Personajes en páginas

source: Edited pages
es: Páginas editadas

source: Edited characters
es: Personajes editados

source: Sounds created
es: Sonidos creados

source: File uploaded succesfully!
es: ¡Fichero cargado con éxito!

source: The file must have the extension .sjr!
es: ¡El archivo debe tener la extensión .sjr!

source: Fill the required fields
es: Rellene los campos obligatorios

source: The file must have the extension .zip!
es: ¡El archivo debe tener la extensión .zip!

source: Updated data!
es: ¡Datos actualizados!

source: Fill all data!
es: ¡Rellene todos los datos!

source: File delete succesfully!
es: ¡Fichero eliminado con éxito!

source: Error: Student's name is already used!
es: Error: ¡El nombre del estudiante ya está en uso!

source: Student edit succesfully!
es: ¡Estudiante editado con éxito!

source: Error: The file name is already in use!
es: Error: ¡El nombre del archivo ya está en uso!

source: File edit succesfully!
es: ¡Fichero editado con éxito!

source: occasions
es: ocasiones

source: Projects must be named as indicated in the form description
es: Proyectos deben estar nombrados como indica la descripción del formulario
